// 二进制中1的个数
// 描述
// 输入一个整数，输出该数32位二进制表示中1的个数。其中负数用补码表示。
// 示例1
// 输入：
// 10
// 复制
// 返回值：
// 2
// 注意编译器已将负数转换成补码

//     10
//     1010 & 1001 -> 1000
//     1000 & 0111 -> 0000

//     -10
//     11010 & 11001 -> 11000
//     11000 & 10111 -> 10000
//     10000 & 01111 -> 00000
function NumberOf1(n) {
    let count = 0;
    while (n != 0) {
        count++;
        console.log(n);
        n = (n - 1) & n;
    }
    console.log(n);
    return count;
}
module.exports = {
    NumberOf1: NumberOf1
};